RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_tsi_v6.h
    base->CONFIG = ((base->CONFIG) & ~TSI_CONFIG_TSICH_MASK) | (TSI_CONFIG_TSICH(channel));
}

/*!
 * @brief Get the current measured channel number, in self-cap mode.
 *
 * @param    base    TSI peripheral base address.
 * @return   uint8_t    Channel number 0 ... 24.
 * @note     This API can only be used in self-cap mode!
 */
static inline uint8_t TSI_GetSelfCapMeasuredChannel(TSI_Type *base)
{
    return (uint8_t)((base->CONFIG & TSI_CONFIG_TSICH_MASK) >> TSI_CONFIG_TSICH_SHIFT);
}

/*!
 * @brief Decide whether to enable End of Scan DMA transfer request only.
 *
 * @param    base TSI peripheral base address.
 * @param    enable  Choose whether to enable End of Scan DMA transfer request only.
 *                   - true  Enable End of Scan DMA transfer request only;
 *                   - false Both End-of-Scan and Out-of-Range can generate DMA transfer request.
 * @return   none.
 */
static inline void TSI_EnableEndOfScanDmaTransferOnly(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) |
                      TSI_GENCS_DMAEN_EOS_MASK; /* Enable End of Scan DMA transfer request only; */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) &
                      (~TSI_GENCS_DMAEN_EOS_MASK); /* Both types of events can generate DMA transfer request. */
    }
}

/*!
 * @brief Gets the conversion counter value.
 *
 * @param    base TSI peripheral base address.
 * @return   Accumulated scan counter value ticked by the reference clock.
 */
static inline uint16_t TSI_GetCounter(TSI_Type *base)
{
    return (uint16_t)(base->DATA & TSI_DATA_TSICNT_MASK);
}

/*!
 * @brief Set the TSI wake-up channel low threshold.
 *
 * @param    base           TSI peripheral base address.
 * @param    low_threshold  Low counter threshold.
 * @return   none.
 */
static inline void TSI_SetLowThreshold(TSI_Type *base, uint16_t low_threshold)
{
    base->TSHD = ((base->TSHD) & ~TSI_TSHD_THRESL_MASK) | (TSI_TSHD_THRESL(low_threshold));
}

/*!
 * @brief Set the TSI wake-up channel high threshold.
 *
 * @param    base            TSI peripheral base address.
 * @param    high_threshold  High counter threshold.
 * @return   none.
 */
static inline void TSI_SetHighThreshold(TSI_Type *base, uint16_t high_threshold)
{
    base->TSHD = ((base->TSHD) & ~TSI_TSHD_THRESH_MASK) | (TSI_TSHD_THRESH(high_threshold));
}

/*!
 * @brief Set the main clock of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mainClock   clock option value.
 * @return   none.
 */
static inline void TSI_SetMainClock(TSI_Type *base, tsi_main_clock_selection_t mainClock)
{
    base->GENCS = ((base->GENCS) & ~TSI_GENCS_SETCLK_MASK) | (TSI_GENCS_SETCLK(mainClock));
}

/*!
 * @brief Set the sensing mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mode   Mode value.
 * @return   none.
 */
static inline void TSI_SetSensingMode(TSI_Type *base, tsi_sensing_mode_selection_t mode)
{
    base->CONFIG = ((base->CONFIG) & ~TSI_CONFIG_MODE_MASK) | (TSI_CONFIG_MODE(mode));
}

/*!
 * @brief Get the sensing mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @return   Currently selected sensing mode.
 */
static inline tsi_sensing_mode_selection_t TSI_GetSensingMode(TSI_Type *base)
{
    return (tsi_sensing_mode_selection_t)(uint32_t)((base->CONFIG & TSI_CONFIG_MODE_MASK) >> TSI_CONFIG_MODE_SHIFT);
}

/*!
 * @brief Set the DVOLT settings.
 *
 * @param    base    TSI peripheral base address.
 * @param    dvolt   The voltage rails.
 * @return   none.
 */
static inline void TSI_SetDvolt(TSI_Type *base, tsi_dvolt_option_t dvolt)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_DVOLT_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_DVOLT(dvolt));
}

/*!
 * @brief Enable self-cap mode noise cancellation function or not.
 *
 * @param    base                TSI peripheral base address.
 * @param    enableCancellation  Choose whether to enable noise cancellation in self-cap mode
 *                               - true  Enable noise cancellation;
 *                               - false Disable noise cancellation;
 * @return   none.
 */
static inline void TSI_EnableNoiseCancellation(TSI_Type *base, bool enableCancellation)
{
    base->CONFIG = ((base->CONFIG) & ~TSI_CONFIG_S_NOISE_MASK) | (TSI_CONFIG_S_NOISE(enableCancellation));
}

/*!
 * @brief Set the mutual-cap mode TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_SetMutualCapTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->CONFIG_MUTUAL =
        ((base->CONFIG_MUTUAL) & ~TSI_CONFIG_MUTUAL_M_SEL_TX_MASK) | (TSI_CONFIG_MUTUAL_M_SEL_TX(txChannel));
}

/*!
 * @brief Get the current measured TX channel number, in mutual-cap mode.
 *
 * @param    base    TSI peripheral base address;
 * @return           Tx Channel number 0 ... 5;
 * @note     This API can only be used in mutual-cap mode!
 */
static inline tsi_mutual_tx_channel_t TSI_GetTxMutualCapMeasuredChannel(TSI_Type *base)
{
    return (tsi_mutual_tx_channel_t)(uint32_t)((base->CONFIG_MUTUAL & TSI_CONFIG_MUTUAL_M_SEL_TX_MASK) >>
                                               TSI_CONFIG_MUTUAL_M_SEL_TX_SHIFT);
}

/*!
 * @brief Set the mutual-cap mode RX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    rxChannel  Mutual-cap mode RX channel number
 * @return   none.
 */
static inline void TSI_SetMutualCapRxChannel(TSI_Type *base, tsi_mutual_rx_channel_t rxChannel)
{
    base->CONFIG_MUTUAL =
        ((base->CONFIG_MUTUAL) & ~TSI_CONFIG_MUTUAL_M_SEL_RX_MASK) | (TSI_CONFIG_MUTUAL_M_SEL_RX(rxChannel));
}

/*!
 * @brief Get the current measured RX channel number, in mutual-cap mode.
 *
 * @param    base    TSI peripheral base address;
 * @return           Rx Channel number 6 ... 11;
 * @note     This API can only be used in mutual-cap mode!
 */
static inline tsi_mutual_rx_channel_t TSI_GetRxMutualCapMeasuredChannel(TSI_Type *base)
{
    return (tsi_mutual_rx_channel_t)(uint32_t)((base->CONFIG_MUTUAL & TSI_CONFIG_MUTUAL_M_SEL_RX_MASK) >>
                                               TSI_CONFIG_MUTUAL_M_SEL_RX_SHIFT);
}

/*!
 * @brief Set the SSC clock mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mode   SSC mode option value.
 * @return   none.
 */
static inline void TSI_SetSscMode(TSI_Type *base, tsi_ssc_mode_t mode)
{
    base->SSC0 = ((base->SSC0) & ~TSI_SSC0_SSC_MODE_MASK) | (TSI_SSC0_SSC_MODE(mode));
}

/*!
 * @brief Set the SSC prescaler of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    prescaler  SSC prescaler option value.
 * @return   none.
 */
static inline void TSI_SetSscPrescaler(TSI_Type *base, tsi_ssc_prescaler_t prescaler)
{
    base->SSC0 = ((base->SSC0) & ~TSI_SSC0_SSC_PRESCALE_NUM_MASK) | (TSI_SSC0_SSC_PRESCALE_NUM(prescaler));
}

/*!
 * @brief Set used mutual-cap TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_SetUsedTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->MUL = (base->MUL) | (TSI_MUL_M_TX_USED(1UL << (uint8_t)txChannel));
}

/*!
 * @brief Clear used mutual-cap TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_ClearUsedTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->MUL &= ~TSI_MUL_M_TX_USED(1UL << (uint8_t)txChannel);
}

#ifdef __cplusplus
}
#endif /* __cplusplus */

/*! @}*/

#endif /* _FSL_TSI_V6_H_ */
